Revit 2026 API

# DividedPathSeparateReferencesIntoConnectedReferences Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<IList<Reference>> SeparateReferencesIntoConnectedReferences(
	Document document,
	IList<Reference> curveReferences
)
```
```vb
Public Shared Function SeparateReferencesIntoConnectedReferences (
	document As Document,
	curveReferences As IList(Of Reference)
) As IList(Of IList(Of Reference))
```
```cpp
public:
static IList<IList<Reference^>^>^ SeparateReferencesIntoConnectedReferences(
	Document^ document,
	IList<Reference^>^ curveReferences
)
```
```fsharp
static member SeparateReferencesIntoConnectedReferences :
        document : Document *
        curveReferences : IList<Reference> -> IList<IList<Reference>>
```

#### Parameters

document Document

curveReferences IListReference

#### Return Value

IListIListReference

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace